In [1]:
import pandas as pd

In [2]:
ML_df = pd.DataFrame ({"Name":["Rohit","Arpit","Chiranjeev","Piyush"],
        "Student_ID":["101","102","103","104"]})
NLP_df = pd.DataFrame ({"Name":["Rohit","Aman","Ayush","Piyush"],
        "Student_ID":["101","105","106","104"]})
CV_df = pd.DataFrame ({"Name":["Rohit","Arpit","Pawan","Ayush"],
        "Student_ID":["101","102","107","106"]})

In [3]:
ML_df

         Name Student_ID
0       Rohit        101
1       Arpit        102
2  Chiranjeev        103
3      Piyush        104

In [4]:
NLP_df

     Name Student_ID
0   Rohit        101
1    Aman        105
2   Ayush        106
3  Piyush        104

In [5]:
CV_df

    Name Student_ID
0  Rohit        101
1  Arpit        102
2  Pawan        107
3  Ayush        106

In [6]:
ML_df[ML_df.Student_ID.isin(NLP_df.Student_ID) == False]

         Name Student_ID
1       Arpit        102
2  Chiranjeev        103